---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseHeatingCredits
source: html/fdcb479b-a4f7-9ba8-b6f7-d8f7caba78fd.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseHeatingCredits Property

If true, Revit will use heating credits in the final load sum calculations.
 If false, Revit will ignore heating credits in the final load sum calculations.

## Syntax (C#)
```csharp
public bool UseHeatingCredits { get; set; }
```